package com.newsuper.t.juejinbao.ui.song.entity;

import java.util.List;

public class AlbumDetailEntity {


    /**
     * code : 0
     * msg : success
     * data : {"categorys":{"thumbnail":"http://jjlmobile.juejinchain.com/images/music/华语新歌.png","title":"礼貌","desc":"三更半夜 / 余泽雅","play_count":4,"alias":14,"bg_img":""},"songs":[{"id":3665,"song_id":32701152,"cid":14,"song_name":"灰色轨迹","singer":"Beyond","special_name":"BEYOND金碟至尊精选","image":"http://p2.music.126.net/K_p-jhEvCpP7I4Sqd_QfFw==/7954966627607511.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 黄家驹\n[00:00.341] 作词 : 刘卓辉\n[00:01.24]主唱：黄家驹\n[00:02.24]和声：黄家驹\n[00:03.24]编曲：Beyond\n[00:16.24]酒一再沉溺 何时麻醉我抑郁\n[00:23.12]过去了的一切会平息\n[00:29.43]冲不破墙壁 前路没法看得清\n[00:36.49]再有那些挣扎与被迫\n[00:43.33]踏着灰色的轨迹\n[00:50.23]尽是深渊的水影\n[00:56.60]我已背上一身苦困后悔与唏嘘\n[01:03.22]你眼里却此刻充满泪\n[01:09.65]这个世界已不知不觉地空虚\n[01:15.27]Woo～不想你别去\n[01:23.40]心一再回忆 谁能为我去掩饰\n[01:30.09]到哪里都跟你要认识\n[01:36.11]洗不去痕迹 何妨面对要可惜\n[01:43.33]各有各的方向与目的\n[01:50.17]踏着灰色的轨迹\n[01:56.89]尽是深渊的水影\n[02:03.22]我已背上一身苦困后悔与唏嘘\n[02:09.87]你眼里却此刻充满泪\n[02:16.54]这个世界已不知不觉地空虚\n[02:22.50]Woo～不想你别去\n[02:57.14]踏着灰色的轨迹\n[03:03.67]尽是深渊的水影\n[03:10.09]我已背上一身苦困后悔与唏嘘\n[03:16.55]你眼里却此刻充满泪\n[03:19.76]\n[03:23.29]这个世界已不知不觉地空虚\n[03:29.04]Woo～不想你别去\n[03:36.73]我已背上一身苦困后悔与唏嘘\n[03:43.36]你眼里却此刻充满泪\n[03:49.90]这个世界已不知不觉地空虚\n[03:55.54]Woo～不想你别去\n[04:10.98]听着歌\n[04:35.62]让我们再回味以前的生活\n","song_url":"http://music.163.com/song/media/outer/url?id=32701152.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3664,"song_id":115162,"cid":14,"song_name":"月半小夜曲","singer":"李克勤","special_name":"经典金曲","image":"http://p1.music.126.net/bYTctrjUegSyzDPteIeNOw==/74766790705099.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 河合奈保子\n[00:00.010] 作词 : 向雪怀\n[00:00.30]编曲 : 杜自持\n[00:24.64]仍然倚在失眠夜\n[00:27.69]望天边星宿\n[00:30.49]仍然听见小提琴\n[00:33.39]如泣似诉再挑逗\n[00:36.39]为何只剩一弯月\n[00:39.39]留在我的天空\n[00:43.19]这晚以后音讯隔绝\n[00:48.44]人如天上的明月\n[00:51.88]是不可拥有\n[00:54.33]情如曲过只遗留\n[00:57.33]无可挽救再分别\n[01:00.42]为何只是失望\n[01:03.38]填密我的空虚\n[01:07.23]这晚夜 没有吻别\n[01:12.37]仍在说永久\n[01:15.62]想不到是借口\n[01:18.57]从未意会要分手\n[01:27.32]但我的心每分每刻\n[01:30.23]仍然被她占有\n[01:34.53]她似这月儿\n[01:36.28]仍然是不开口\n[01:39.33]提琴独奏独奏着\n[01:42.38]明月半倚深秋\n[01:46.00]我的牵挂\n[01:47.40]我的渴望\n[01:48.60]直至以后\n[02:21.39]仍然倚在失眠夜\n[02:24.49]望天边星宿\n[02:27.24]仍然听见小提琴\n[02:30.09]如泣似诉再挑逗\n[02:33.14]为何只剩一弯月\n[02:36.19]留在我的天空\n[02:39.94]这晚以后音讯隔绝\n[02:45.19]人如天上的明月\n[02:48.19]是不可拥有\n[02:51.09]情如曲过只遗留\n[02:54.04]无可挽救再分别\n[02:57.09]为何只是失望\n[03:00.09]填密我的空虚\n[03:03.84]这晚夜没有吻别\n[03:09.09]仍在说永久\n[03:12.44]想不到是借口\n[03:15.39]从未意会要分手\n[03:24.00]但我的心每分每刻\n[03:26.95]仍然被她占有\n[03:31.15]她似这月儿\n[03:32.90]仍然是不开口\n[03:35.90]提琴独奏独奏着\n[03:39.05]明月半倚深秋\n[03:42.70]我的牵挂\n[03:44.10]我的渴望\n[03:45.30]直至以后\n[03:48.05]仍在说永久\n[03:51.30]想不到是借口\n[03:54.35]从未意会要分手\n[04:02.95]但我的心每分每刻\n[04:05.85]仍然被她占有\n[04:10.10]她似这月儿\n[04:12.44]仍然是不开口\n[04:14.95]提琴独奏独奏着\n[04:18.00]明月半倚深秋\n[04:21.66]我的牵挂\n[04:23.11]我的渴望\n[04:24.31]直至以后\n","song_url":"http://music.163.com/song/media/outer/url?id=115162.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3663,"song_id":190352,"cid":14,"song_name":"星星点灯","singer":"郑智化","special_name":"星星点灯","image":"http://p2.music.126.net/5HgfyC4-6rfZZyN7Z8RMqQ==/109951163449879350.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 郑智化\n[00:01.000] 作词 : 郑智化\n[00:59.520]抬头的一片天 是男儿的一片天\n[01:04.080]曾经在满天的星光下做梦的少年\n[01:08.800]不知道天多高 不知道海多远\n[01:13.360]却发誓要带着你远走到海角天边\n[01:18.140]不负责任的誓言 年少轻狂的我\n[01:22.660]在黑暗中迷失才发现自己的脆弱\n[01:27.370]看着你哭红的眼睛 想着远离的家门\n[01:32.100]满天的星星请为我点盏希望的灯火\n[01:36.690]星星点灯 照亮我的家门\n[01:41.160]让迷失的孩子找到来时的路\n[01:45.970]星星点灯 照亮我的前程\n[01:50.450]用一点光 温暖孩子的心\n[01:55.970]\n[02:11.740]现在的一片天 是肮脏的一片天\n[02:16.370]星星在文明的天空里再也看不见\n[02:20.960]天其实并不高 海其实也不远\n[02:25.670]人心其实比天高 比海更遥远\n[02:30.090]学会骗人的谎言 追逐名利的我\n[02:34.960]在现实中迷失才发现自己的脆弱\n[02:39.650]看着你含泪地离去 想着茫茫的前程\n[02:44.320]远方的星星请为我点盏希望的灯火\n[02:48.910]星星点灯 照亮我的家门\n[02:53.380]让迷失的孩子找到来时的路\n[02:58.190]星星点灯 照亮我的前程\n[03:03.130]用一点光 温暖孩子的心\n[03:07.440]\n[03:33.380]多年以后一场大雨惊醒沉睡的我\n[03:38.150]突然之间都市的霓虹都不再闪烁\n[03:42.480]天边有颗模糊的星光偷偷探出了头\n[03:47.130]是你的眼神依旧在远方为我在等候\n[03:52.070]星星点灯 照亮我的家门\n[03:56.280]让迷失的孩子找到来时的路\n[04:01.150]星星点灯 照亮我的前程\n[04:05.520]用一点光 温暖孩子的心\n[04:10.420]星星点灯 照亮我的家门\n[04:14.940]让迷失的孩子找到来时的路\n[04:19.810]星星点灯 照亮我的前程\n[04:24.230]用一点光 温暖孩子的心\n","song_url":"http://music.163.com/song/media/outer/url?id=190352.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3662,"song_id":285005,"cid":14,"song_name":"橄榄树","singer":"齐豫","special_name":"橄榄树","image":"http://p2.music.126.net/TTw8EZLQJl7eU5Ankp-kJQ==/109951163033230673.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 李泰祥\n[00:01.000] 作词 : 三毛\n[00:33.250]不要问我从哪里来\n[00:39.800]我的故乡在远方\n[00:46.200]为什么流浪\n[00:51.080]流浪远方 流浪\n[01:02.260]为了天空飞翔的小鸟\n[01:08.160]为了山间轻流的小溪\n[01:14.100]为了宽阔的草原\n[01:19.100]流浪远方 流浪\n[01:31.750]还有 还有\n[01:35.800]为了梦中的橄榄树 橄榄树\n[01:43.650]不要问我从哪里来\n[01:49.710]我的故乡在远方\n[02:02.600]为什么流浪\n[02:08.600]为什么流浪远方\n[02:24.300]为了我梦中的\n[02:37.000]橄榄树\n[02:40.200]\n[02:41.450]不要问我从哪里来\n[02:48.190]我的故乡在远方\n[02:54.200]为什么流浪\n[02:59.150]流浪远方 流浪\n[03:12.700]\n","song_url":"http://music.163.com/song/media/outer/url?id=285005.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3661,"song_id":37202358,"cid":14,"song_name":"我终于失去了你","singer":"赵传","special_name":"隐藏的歌手 第七期","image":"http://p2.music.126.net/3KEfBxzpHSToNVLQL0uK-Q==/3386495815358400.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 李宗盛\n[00:01.000] 作词 : 李宗盛\n[00:35.840]当所有的人离开我的时候\n[00:39.540]你劝我要耐心等候\n[00:43.430]并且陪我渡过生命中最长的寒冬\n[00:47.300]如此地宽容\n[00:50.310]当所有的人靠紧我的时候\n[00:54.210]你要我安静从容\n[00:58.070]似乎知道我有一颗永不安静的心\n[01:02.020]（我）容易蠢动\n[01:05.390]我终于让千百双手在我面前挥舞\n[01:08.760]我终于拥有了千百个热情的笑容\n[01:12.950]我终于让人群被我深深的打动\n[01:16.180]我却忘了告诉你\n[01:18.540]你一直在我心中\n[01:21.740]啊~我终于失去了你\n[01:25.520]在拥挤的人群中\n[01:29.650]我终于失去了你\n[01:32.630]当我的人生第一次感到光荣\n[01:36.300]啊~我终于失去了你\n[01:40.400]在拥挤的人群中\n[01:44.110]我终于失去了你\n[01:47.570]当我的人生第一次感到光荣\n[01:55.270]当四周掌声如潮水一般的汹涌\n[01:58.810]我见到你眼中有伤心的泪光闪动\n[02:06.630]\n","song_url":"http://music.163.com/song/media/outer/url?id=37202358.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0}]}
     */

    private int code;
    private String msg;
    private DataBean data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * categorys : {"thumbnail":"http://jjlmobile.juejinchain.com/images/music/华语新歌.png","title":"礼貌","desc":"三更半夜 / 余泽雅","play_count":4,"alias":14,"bg_img":""}
         * songs : [{"id":3665,"song_id":32701152,"cid":14,"song_name":"灰色轨迹","singer":"Beyond","special_name":"BEYOND金碟至尊精选","image":"http://p2.music.126.net/K_p-jhEvCpP7I4Sqd_QfFw==/7954966627607511.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 黄家驹\n[00:00.341] 作词 : 刘卓辉\n[00:01.24]主唱：黄家驹\n[00:02.24]和声：黄家驹\n[00:03.24]编曲：Beyond\n[00:16.24]酒一再沉溺 何时麻醉我抑郁\n[00:23.12]过去了的一切会平息\n[00:29.43]冲不破墙壁 前路没法看得清\n[00:36.49]再有那些挣扎与被迫\n[00:43.33]踏着灰色的轨迹\n[00:50.23]尽是深渊的水影\n[00:56.60]我已背上一身苦困后悔与唏嘘\n[01:03.22]你眼里却此刻充满泪\n[01:09.65]这个世界已不知不觉地空虚\n[01:15.27]Woo～不想你别去\n[01:23.40]心一再回忆 谁能为我去掩饰\n[01:30.09]到哪里都跟你要认识\n[01:36.11]洗不去痕迹 何妨面对要可惜\n[01:43.33]各有各的方向与目的\n[01:50.17]踏着灰色的轨迹\n[01:56.89]尽是深渊的水影\n[02:03.22]我已背上一身苦困后悔与唏嘘\n[02:09.87]你眼里却此刻充满泪\n[02:16.54]这个世界已不知不觉地空虚\n[02:22.50]Woo～不想你别去\n[02:57.14]踏着灰色的轨迹\n[03:03.67]尽是深渊的水影\n[03:10.09]我已背上一身苦困后悔与唏嘘\n[03:16.55]你眼里却此刻充满泪\n[03:19.76]\n[03:23.29]这个世界已不知不觉地空虚\n[03:29.04]Woo～不想你别去\n[03:36.73]我已背上一身苦困后悔与唏嘘\n[03:43.36]你眼里却此刻充满泪\n[03:49.90]这个世界已不知不觉地空虚\n[03:55.54]Woo～不想你别去\n[04:10.98]听着歌\n[04:35.62]让我们再回味以前的生活\n","song_url":"http://music.163.com/song/media/outer/url?id=32701152.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3664,"song_id":115162,"cid":14,"song_name":"月半小夜曲","singer":"李克勤","special_name":"经典金曲","image":"http://p1.music.126.net/bYTctrjUegSyzDPteIeNOw==/74766790705099.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 河合奈保子\n[00:00.010] 作词 : 向雪怀\n[00:00.30]编曲 : 杜自持\n[00:24.64]仍然倚在失眠夜\n[00:27.69]望天边星宿\n[00:30.49]仍然听见小提琴\n[00:33.39]如泣似诉再挑逗\n[00:36.39]为何只剩一弯月\n[00:39.39]留在我的天空\n[00:43.19]这晚以后音讯隔绝\n[00:48.44]人如天上的明月\n[00:51.88]是不可拥有\n[00:54.33]情如曲过只遗留\n[00:57.33]无可挽救再分别\n[01:00.42]为何只是失望\n[01:03.38]填密我的空虚\n[01:07.23]这晚夜 没有吻别\n[01:12.37]仍在说永久\n[01:15.62]想不到是借口\n[01:18.57]从未意会要分手\n[01:27.32]但我的心每分每刻\n[01:30.23]仍然被她占有\n[01:34.53]她似这月儿\n[01:36.28]仍然是不开口\n[01:39.33]提琴独奏独奏着\n[01:42.38]明月半倚深秋\n[01:46.00]我的牵挂\n[01:47.40]我的渴望\n[01:48.60]直至以后\n[02:21.39]仍然倚在失眠夜\n[02:24.49]望天边星宿\n[02:27.24]仍然听见小提琴\n[02:30.09]如泣似诉再挑逗\n[02:33.14]为何只剩一弯月\n[02:36.19]留在我的天空\n[02:39.94]这晚以后音讯隔绝\n[02:45.19]人如天上的明月\n[02:48.19]是不可拥有\n[02:51.09]情如曲过只遗留\n[02:54.04]无可挽救再分别\n[02:57.09]为何只是失望\n[03:00.09]填密我的空虚\n[03:03.84]这晚夜没有吻别\n[03:09.09]仍在说永久\n[03:12.44]想不到是借口\n[03:15.39]从未意会要分手\n[03:24.00]但我的心每分每刻\n[03:26.95]仍然被她占有\n[03:31.15]她似这月儿\n[03:32.90]仍然是不开口\n[03:35.90]提琴独奏独奏着\n[03:39.05]明月半倚深秋\n[03:42.70]我的牵挂\n[03:44.10]我的渴望\n[03:45.30]直至以后\n[03:48.05]仍在说永久\n[03:51.30]想不到是借口\n[03:54.35]从未意会要分手\n[04:02.95]但我的心每分每刻\n[04:05.85]仍然被她占有\n[04:10.10]她似这月儿\n[04:12.44]仍然是不开口\n[04:14.95]提琴独奏独奏着\n[04:18.00]明月半倚深秋\n[04:21.66]我的牵挂\n[04:23.11]我的渴望\n[04:24.31]直至以后\n","song_url":"http://music.163.com/song/media/outer/url?id=115162.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3663,"song_id":190352,"cid":14,"song_name":"星星点灯","singer":"郑智化","special_name":"星星点灯","image":"http://p2.music.126.net/5HgfyC4-6rfZZyN7Z8RMqQ==/109951163449879350.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 郑智化\n[00:01.000] 作词 : 郑智化\n[00:59.520]抬头的一片天 是男儿的一片天\n[01:04.080]曾经在满天的星光下做梦的少年\n[01:08.800]不知道天多高 不知道海多远\n[01:13.360]却发誓要带着你远走到海角天边\n[01:18.140]不负责任的誓言 年少轻狂的我\n[01:22.660]在黑暗中迷失才发现自己的脆弱\n[01:27.370]看着你哭红的眼睛 想着远离的家门\n[01:32.100]满天的星星请为我点盏希望的灯火\n[01:36.690]星星点灯 照亮我的家门\n[01:41.160]让迷失的孩子找到来时的路\n[01:45.970]星星点灯 照亮我的前程\n[01:50.450]用一点光 温暖孩子的心\n[01:55.970]\n[02:11.740]现在的一片天 是肮脏的一片天\n[02:16.370]星星在文明的天空里再也看不见\n[02:20.960]天其实并不高 海其实也不远\n[02:25.670]人心其实比天高 比海更遥远\n[02:30.090]学会骗人的谎言 追逐名利的我\n[02:34.960]在现实中迷失才发现自己的脆弱\n[02:39.650]看着你含泪地离去 想着茫茫的前程\n[02:44.320]远方的星星请为我点盏希望的灯火\n[02:48.910]星星点灯 照亮我的家门\n[02:53.380]让迷失的孩子找到来时的路\n[02:58.190]星星点灯 照亮我的前程\n[03:03.130]用一点光 温暖孩子的心\n[03:07.440]\n[03:33.380]多年以后一场大雨惊醒沉睡的我\n[03:38.150]突然之间都市的霓虹都不再闪烁\n[03:42.480]天边有颗模糊的星光偷偷探出了头\n[03:47.130]是你的眼神依旧在远方为我在等候\n[03:52.070]星星点灯 照亮我的家门\n[03:56.280]让迷失的孩子找到来时的路\n[04:01.150]星星点灯 照亮我的前程\n[04:05.520]用一点光 温暖孩子的心\n[04:10.420]星星点灯 照亮我的家门\n[04:14.940]让迷失的孩子找到来时的路\n[04:19.810]星星点灯 照亮我的前程\n[04:24.230]用一点光 温暖孩子的心\n","song_url":"http://music.163.com/song/media/outer/url?id=190352.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3662,"song_id":285005,"cid":14,"song_name":"橄榄树","singer":"齐豫","special_name":"橄榄树","image":"http://p2.music.126.net/TTw8EZLQJl7eU5Ankp-kJQ==/109951163033230673.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 李泰祥\n[00:01.000] 作词 : 三毛\n[00:33.250]不要问我从哪里来\n[00:39.800]我的故乡在远方\n[00:46.200]为什么流浪\n[00:51.080]流浪远方 流浪\n[01:02.260]为了天空飞翔的小鸟\n[01:08.160]为了山间轻流的小溪\n[01:14.100]为了宽阔的草原\n[01:19.100]流浪远方 流浪\n[01:31.750]还有 还有\n[01:35.800]为了梦中的橄榄树 橄榄树\n[01:43.650]不要问我从哪里来\n[01:49.710]我的故乡在远方\n[02:02.600]为什么流浪\n[02:08.600]为什么流浪远方\n[02:24.300]为了我梦中的\n[02:37.000]橄榄树\n[02:40.200]\n[02:41.450]不要问我从哪里来\n[02:48.190]我的故乡在远方\n[02:54.200]为什么流浪\n[02:59.150]流浪远方 流浪\n[03:12.700]\n","song_url":"http://music.163.com/song/media/outer/url?id=285005.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0},{"id":3661,"song_id":37202358,"cid":14,"song_name":"我终于失去了你","singer":"赵传","special_name":"隐藏的歌手 第七期","image":"http://p2.music.126.net/3KEfBxzpHSToNVLQL0uK-Q==/3386495815358400.jpg?param=130y130","lyric":"[00:00.000] 作曲 : 李宗盛\n[00:01.000] 作词 : 李宗盛\n[00:35.840]当所有的人离开我的时候\n[00:39.540]你劝我要耐心等候\n[00:43.430]并且陪我渡过生命中最长的寒冬\n[00:47.300]如此地宽容\n[00:50.310]当所有的人靠紧我的时候\n[00:54.210]你要我安静从容\n[00:58.070]似乎知道我有一颗永不安静的心\n[01:02.020]（我）容易蠢动\n[01:05.390]我终于让千百双手在我面前挥舞\n[01:08.760]我终于拥有了千百个热情的笑容\n[01:12.950]我终于让人群被我深深的打动\n[01:16.180]我却忘了告诉你\n[01:18.540]你一直在我心中\n[01:21.740]啊~我终于失去了你\n[01:25.520]在拥挤的人群中\n[01:29.650]我终于失去了你\n[01:32.630]当我的人生第一次感到光荣\n[01:36.300]啊~我终于失去了你\n[01:40.400]在拥挤的人群中\n[01:44.110]我终于失去了你\n[01:47.570]当我的人生第一次感到光荣\n[01:55.270]当四周掌声如潮水一般的汹涌\n[01:58.810]我见到你眼中有伤心的泪光闪动\n[02:06.630]\n","song_url":"http://music.163.com/song/media/outer/url?id=37202358.mp3","playlist_name":"经典老歌","play_count":0,"create_time":0,"status":1,"cate_id":0}]
         */

        private CategorysBean categorys;
        private List<SongBean> songs;

        public CategorysBean getCategorys() {
            return categorys;
        }

        public void setCategorys(CategorysBean categorys) {
            this.categorys = categorys;
        }

        public List<SongBean> getSongs() {
            return songs;
        }

        public void setSongs(List<SongBean> songs) {
            this.songs = songs;
        }
    }
}
