package com.newsuper.t.juejinbao.ui.song.entity;

import com.newsuper.t.juejinbao.bean.Entity;

import java.util.List;

public class MusicSearchEntity extends Entity {

    /**
     * data : [{"type":"qq","link":"http://y.qq.com/n/yqq/song/003aPyzn20chCt.html","songid":"003aPyzn20chCt","title":"不","author":"陈百强","lrc":"[ti:不]\n[ar:陈百强]\n[al:228550]\n[by:]\n[offset:0]\n[00:00.00]不 - 陈百强 (Danny Chan)\n[00:04.11]词：郑国江\n[00:08.23]曲：鲍比达\n[00:12.34]请 不要问\n[00:17.02]请 不要问\n[00:23.29]只想快乐\n[00:28.38]不想有恨\n[00:34.08]游子一般步伐没法歇一阵\n[00:39.51]我只求新\n[00:44.54]年青的心没法锁得太紧\n[00:50.59]身边一片缤纷\n[00:55.95]不愿生根\n[00:58.90]怕留脚印\n[01:01.60]不定的心\n[01:03.62]永不为谁留恨\n[01:06.40]你不需要\n[01:09.42]亦不必要\n[01:12.13]愁城坐困 为我等\n[01:17.17]请 不要问\n[01:22.83]请 不要问\n[01:28.21]倘使有梦\n[01:33.73]尽管去寻\n[01:39.74]行色匆匆但愿莫再追问\n[01:45.17]太多原因\n[01:49.93]年青的心没法知得太深\n[01:55.70]不想使你担心\n[02:01.60]不愿生根\n[02:04.39]怕留脚印\n[02:07.05]不定的心\n[02:09.28]永不为谁留恨\n[02:11.96]你不需要\n[02:14.94]亦不必要\n[02:17.77]愁城坐困 为我等\n[02:23.49]心是真心\n[02:25.33]\n[02:26.36]却难永印\n[02:29.01]今日的真\n[02:31.07]瞬息便成疑问\n[02:34.42]你不需要\n[02:36.87]亦不必要\n[02:39.41]常常为我 认真\n[02:47.03]请 不要问\n[02:52.75]请 不要问\n[02:58.64]心中说话\n[03:04.34]不想告人\n[03:09.61]请 不要问\n[03:14.98]请 不要问\n[03:21.07]心中说话\n[03:26.31]不想告人\n[03:31.79]心中说话\n[03:37.17]不想告人","url":"http://dl.stream.qqmusic.qq.com/C100003aPyzn20chCt.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001eP4c53pMFrT.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001ulFDx4Zh9Gv.html","songid":"001ulFDx4Zh9Gv","title":"不","author":"太一","lrc":"[ti:不]\n[ar:太一]\n[al:不]\n[by:]\n[offset:0]\n[00:00.00]不 - 太一\n[00:14.50]词：太一\n[00:29.00]曲：太一\n[00:43.50]不\n[00:59.86]可你听不见\n[01:19.38]就在你不在的时间里\n[01:23.49]我只想做个废人啊\n[01:26.95]我那抑制的疯狂的渴望的\n[01:31.10]不能表现的思念\n[01:34.62]身陷迷宫我找不到\n[01:38.27]我找不到出口\n[01:43.43]又曾怀疑过的天空\n[01:46.85]碰触过的面容\n[01:51.14]死的不止我和你\n[02:29.01]如果我是一颗流星\n[02:33.34]能否踹进你的口袋里\n[02:36.80]我不需要光明\n[02:39.44]我只需要在你的黑夜里\n[02:44.17]和你沉寂\n[02:47.26](你在我的眼里和云一样)\n[02:50.07]和你哭泣\n[02:52.97]和你忘记\n[02:55.26](可是如今颜色黑白无常)\n[02:58.05]和你死去\n[03:01.93]可你听不见\n[03:10.84]可你听不见","url":"http://dl.stream.qqmusic.qq.com/C100001ulFDx4Zh9Gv.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M0000025qO3W0AXM7z.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001NONFF3lp2kB.html","songid":"001NONFF3lp2kB","title":"不爱我就别伤害我","author":"杨顺高,凯小晴","lrc":"[ti:不爱我就别伤害我]\n[ar:杨顺高/凯小晴]\n[al:不爱我就别伤害我]\n[by:]\n[offset:0]\n[00:00.21]不爱我就别伤害我 - 杨顺高/凯小晴\n[00:02.54]词：杨顺高\n[00:03.21]曲：杨顺高\n[00:03.87]编曲：袁晓杰\n[00:04.68]后期：尘航\n[00:05.36]封面：左意辰\n[00:06.21]出品：猫舍\n[00:22.02]女：\n[00:23.77]不爱我别伤害我\n[00:26.48]爱情到底是什么\n[00:29.24]多少人真心爱过\n[00:32.03]最后成为了过客\n[00:34.90]不爱我别靠近我\n[00:37.68]总让我不死不活\n[00:40.44]还相信爱有结果\n[00:43.25]最傻的也只有我\n[00:45.81]男：\n[00:46.23]从陌生到遇见你\n[00:48.83]从遇见你到一起\n[00:51.57]曾说过不会分离\n[00:54.43]是我对 不起你\n[00:57.18]如果能回到过去\n[00:59.99]宁愿不再认识你\n[01:02.77]不会说出我爱你\n[01:05.57]你也不 会伤心\n[01:07.94]女：\n[01:08.46]如果当初不爱我\n[01:11.12]为何又来招惹我\n[01:13.94]让我受尽了折磨\n[01:16.82]我上辈子欠你的\n[01:19.51]承诺不是随便说\n[01:22.32]衣服不是随便脱\n[01:25.09]爱情到底是什么\n[01:27.90]有几个人会懂得\n[01:30.42]男：\n[01:30.82]其实我也很难过\n[01:33.52]其实我也很不舍\n[01:36.32]但我又能怎样呢\n[01:39.11]爱情就是这样的\n[01:41.83]就当是一个过客\n[01:44.63]心痛不止你一个\n[01:47.42]不该打扰你生活\n[01:50.21]这都是 我的错\n[01:52.72]女：\n[01:53.14]爱上你的那天起\n[01:55.78]就已丢失了自己\n[01:58.59]从没想过会分离\n[02:01.39]所以把全部给你\n[02:04.14]是我太过于爱你\n[02:06.97]所以你才不珍惜\n[02:09.76]你曾躺在我怀里\n[02:12.57]我还以为是爱情\n[02:15.10]男：\n[02:15.53]从陌生到遇见你\n[02:18.11]从遇见你到一起\n[02:20.90]曾说过不会分离\n[02:23.70]是我对 不起你\n[02:26.57]如果能回到过去\n[02:29.30]宁愿不再认识你\n[02:32.12]不会说出我爱你\n[02:34.88]你也不 会伤心\n[02:37.35]女：\n[02:37.84]如果当初不爱我\n[02:40.42]为何又来招惹我\n[02:43.21]让我受尽了折磨\n[02:46.03]我上辈子欠你的\n[02:48.82]承诺不是随便说\n[02:51.57]衣服不是随便脱\n[02:54.39]爱情到底是什么\n[02:57.14]有几个人会懂得\n[02:59.71]男：\n[03:00.15]其实我也很难过\n[03:02.77]其实我也很不舍\n[03:05.57]但我又能怎样呢\n[03:08.37]爱情就是这样的\n[03:11.17]就当是一个过客\n[03:13.94]心痛不止你一个\n[03:16.74]不该打扰你生活\n[03:19.52]这都是 我的错\n[03:21.94]女：\n[03:22.44]如果当初不爱我\n[03:25.13]为何又来招惹我\n[03:27.95]让我受尽了折磨\n[03:30.71]我上辈子欠你的\n[03:33.50]承诺不是随便说\n[03:36.21]衣服不是随便脱\n[03:39.05]爱情到底是什么\n[03:41.84]有几个人会懂得\n[03:44.35]合：\n[03:44.80]从此不再碰感情\n[03:47.42]没你我不是不行\n[03:50.17]被你玩弄被你欺\n[03:53.04]难道这就是爱情\n[03:55.80]真心爱过给错人\n[03:58.56]曾为你失去灵魂\n[04:01.36]从此余生一个人\n[04:04.17]不再为谁而心疼","url":"http://dl.stream.qqmusic.qq.com/C100001NONFF3lp2kB.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000004do9TC3lhpbz.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/004UnWV13dasL2.html","songid":"004UnWV13dasL2","title":"不","author":"痛仰乐队","lrc":"[ti:不]\n[ar:痛苦的信仰]\n[al:不]\n[by:]\n[offset:0]\n[00:00.00]不 - 痛仰乐队 (MISERABLE FAITH)\n[00:16.58]词：高虎\n[00:33.17]曲：高虎\n[00:49.76]不 用相信规矩\n[00:51.76]不 用相信秩序\n[00:53.32]不 用相信经验\n[00:55.38]不 用相信教训\n[00:57.38]不 用相信责任\n[00:59.34]不 用相信义务\n[01:01.34]不 用相信活泼\n[01:03.45]不 用相信严肃\n[01:21.76]不 用相信贵贱\n[01:23.44]不 用相信尊卑\n[01:25.44]不 用相信傀儡\n[01:27.46]不 用相信权威\n[01:29.38]不 用相信稳定\n[01:31.38]不 用相信繁荣\n[01:33.38]不 用相信破坏\n[01:35.38]不 用相信团结\n[02:41.70]不 用相信规矩\n[02:43.45]不 用相信秩序\n[02:45.39]不 用相信经验\n[02:47.39]不 用相信教训\n[02:49.38]不 用相信责任\n[02:51.39]不 用相信义务\n[02:53.39]不 用相信活泼\n[02:55.46]不 用相信严肃\n[02:57.39]不 用相信贵贱\n[02:59.14]不 用相信尊卑\n[03:01.14]不 用相信傀儡\n[03:03.14]不 用相信权威\n[03:05.33]不 用相信稳定\n[03:07.14]不 用相信繁荣\n[03:09.01]不 用相信破坏\n[03:11.26]不 用相信团结\n[03:29.71]不 用相信规矩\n[03:31.21]不 用相信秩序\n[03:33.30]不 用相信经验\n[03:35.30]不 用相信教训\n[03:37.17]不 用相信责任\n[03:39.11]不 用相信义务\n[03:41.31]不 用相信活泼\n[03:43.25]不 用相信严肃\n[03:45.44]不 用相信贵贱\n[03:47.30]不 用相信尊卑\n[03:49.30]不 用相信傀儡\n[03:51.25]不 用相信权威\n[03:53.25]不 用相信稳定\n[03:55.25]不 用相信繁荣\n[03:57.25]不 用相信破坏\n[03:59.37]不 用相信团结","url":"http://dl.stream.qqmusic.qq.com/C100004UnWV13dasL2.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001fTdec1vAehv.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/0035YWDw09QZGc.html","songid":"0035YWDw09QZGc","title":"不爱我就别伤害我","author":"叶筱萱,亚喃","lrc":"不爱我就别伤害我\n\n作词：杨顺高\n作曲：杨顺高\n演唱：叶筱萱+亚喃\n和声编写：叶筱萱\n编曲：GK康康\n后期：罗旦\n出品：猫舍\n\n女：\n不爱我别伤害我\n爱情到底是什么\n多少人真心爱过\n最后成为了过客\n不爱我别靠近我\n总让我不死不活\n还相信爱有结果\n最傻的也只有我\n男：\n从陌生到遇见你\n从遇见你到一起\n曾说过不会分离\n是我对 不起你\n如果能回到过去\n宁愿不再认识你\n不会说出我爱你\n你也不 会伤心\n女：\n如果当初不爱我\n为何又来招惹我\n让我受尽了折磨\n我上辈子欠你的\n承诺不是随便说\n衣服不是随便脱\n爱情到底是什么\n有几个人会懂得\n男：\n其实我也很难过\n其实我也很不舍\n但我又能怎样呢\n爱情就是这样的\n就当是一个过客\n心痛不止你一个\n不该打扰你生活\n这都是 我的错\n女：\n爱上你的那天起\n就已丢失了自己\n从没想过会分离\n所以把全部给你\n是我太过于爱你\n所以你才不珍惜\n你曾躺在我怀里\n我还以为是爱情\n男：\n从陌生到遇见你\n从遇见你到一起\n曾说过不会分离\n是我对 不起你\n如果能回到过去\n宁愿不再认识你\n不会说出我爱你\n你也不 会伤心\n女：\n如果当初不爱我\n为何又来招惹我\n让我受尽了折磨\n我上辈子欠你的\n承诺不是随便说\n衣服不是随便脱\n爱情到底是什么\n有几个人会懂得. \n男：\n其实我也很难过\n其实我也很不舍\n但我又能怎样呢\n爱情就是这样的\n就当是一个过客\n心痛不止你一个\n不该打扰你生活\n这都是 我的错\n合：\n从此不再碰感情\n没你我不是不行\n被你玩弄被你欺\n难道这就是爱情\n真心爱过给错人\n曾为你失去灵魂\n从此余生一个人\n不再为谁而心疼\n合：\n从此不再碰感情\n没你我不是不行\n被你玩弄被你欺\n难道这就是爱情\n真心爱过给错人\n曾为你失去灵魂\n从此余生一个人\n不再为谁而心疼","url":"http://dl.stream.qqmusic.qq.com/C1000035YWDw09QZGc.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001ymMTJ1YPySA.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/000edAg12jLBrN.html","songid":"000edAg12jLBrN","title":"不将就","author":"李荣浩","lrc":"[ti:不将就]\n[ar:李荣浩]\n[al:不将就]\n[by:]\n[offset:0]\n[00:00.00]不将就 (Can't Bear It (Ending Credit Theme Song of \u201cYou Are My Sunshine\u201d)) (《何以笙箫默》电影片尾曲) - 李荣浩 (Ronghao Li)\n[00:04.47]词：黄伟文/李荣浩\n[00:08.94]曲：李荣浩\n[00:13.41]那时候 我以为爱的是生活\n[00:19.79]也算懂得 什么适合什么不可\n[00:26.60]最近还是一样努力着\n[00:30.14]配合你的性格\n[00:33.10]你的追求者 你的坎坷\n[00:36.63]我开的车\n[00:39.22]\n[00:40.24]算一算 虚度了多少个年头\n[00:46.56]仿佛足够写一套错爱的春秋\n[00:53.25]如果以后 你还想为谁\n[00:56.74]浪费美好时候\n[00:59.87]眼泪只能在我的胸膛\n[01:03.27]毫无保留\n[01:07.91]\n[01:10.23]互相折磨到白头\n[01:15.03]\n[01:16.84]悲伤坚决不放手\n[01:22.87]\n[01:23.66]开始纠缠之后\n[01:28.64]才又被人放大了自由\n[01:36.42]\n[01:37.04]你的暴烈太温柔\n[01:43.55]感情又痛又享受\n[01:49.35]\n[01:50.24]如果我说不吻你不罢休\n[01:56.09]谁能逼我将就\n[02:02.48]\n[02:06.99]你问我 为什么顽固而专一\n[02:13.23]天下太大 总有人比你更合适\n[02:19.89]其实我觉得这样不值\n[02:23.50]可没选择方式\n[02:26.54]你一出场别人都显得不过如此\n[02:34.40]\n[02:35.29]互相折磨到白头\n[02:40.56]\n[02:41.82]悲伤坚决不放手\n[02:47.85]\n[02:48.55]开始纠缠之后\n[02:53.57]才又被人放大了自由\n[03:00.84]\n[03:01.96]你的暴烈太温柔\n[03:07.28]\n[03:08.51]感情又痛又享受\n[03:15.22]如果我说不吻你不罢休\n[03:21.06]谁能逼我将就\n[03:29.20]\n[03:58.56]互相折磨到白头\n[04:04.21]\n[04:05.38]悲伤坚决不放手\n[04:11.71]开始纠缠之后\n[04:16.83]才又被人放大了自由\n[04:24.68]\n[04:25.26]你的暴烈太温柔\n[04:31.75]感情又痛又享受\n[04:38.61]如果我说不吻你不罢休\n[04:44.42]谁能逼我将就\n[04:51.13]他们不过将就","url":"http://dl.stream.qqmusic.qq.com/C100000edAg12jLBrN.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001fi1zG0EjU2u.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/002iy0sM0jiLnT.html","songid":"002iy0sM0jiLnT","title":"不染 (Live)","author":"毛不易","lrc":"[ti:不染 (Live)]\n[ar:毛不易]\n[al:\u201c用奋斗点亮幸福\u201d江苏卫视2019跨年演唱会]\n[by:]\n[offset:0]\n[00:01.35]不染 (Live) - 毛不易\n[00:02.45]词：海雷\n[00:03.01]曲：简弘亦\n[00:37.73]不愿染是与非 怎料事与愿违\n[00:44.55]心中的花枯萎 时光它去不回\n[00:51.51]但愿洗去浮华 掸去一身尘灰\n[00:58.75]再与你一壶清酒 话一世沉醉\n[01:05.70]不愿染是与非 怎料事与愿违\n[01:12.78]心中的花枯萎 时光它去不回\n[01:19.88]回忆辗转来回 痛不过这心扉\n[01:26.98]愿只愿余生无悔 随花香远飞\n[01:34.49]一壶清酒 一身尘灰\n[01:41.44]一念来回度余生无悔\n[01:48.61]一场春秋 生生灭灭 浮华是非\n[01:55.56]待花开之时再醉一回\n[02:30.81]不愿染是与非 怎料事与愿违\n[02:37.38]心中的花枯萎 时光它去不回\n[02:44.60]回忆辗转来回 痛不过这心扉\n[02:51.71]愿只愿余生无悔 随花香远飞\n[02:59.10]一壶清酒 一身尘灰\n[03:06.20]一念来回度余生无悔\n[03:13.24]一场春秋 生生灭灭 浮华是非\n[03:20.22]待花开之时再醉一回\n[03:27.35]愿这生生的时光不再枯萎\n[03:34.36]待花开之时再醉一回\n[03:41.45]愿这生生的时光不再枯萎\n[03:48.45]再回首浅尝心酒余味\n[03:55.68]一壶清酒 一身尘灰\n[04:02.55]一念来回度余生无悔\n[04:09.73]一场春秋 生生灭灭 浮华是非\n[04:16.79]待花开之时再醉一回\n[04:23.88]一壶清酒 一身尘灰\n[04:30.85]一念来回度余生无悔\n[04:38.02]一场回忆 生生灭灭 了了心扉\n[04:45.02]再回首浅尝心酒余味\n[04:52.06]一场回忆 生生灭灭 了了心扉\n[04:59.04]再回首浅尝心酒余味","url":"http://dl.stream.qqmusic.qq.com/C100002iy0sM0jiLnT.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M0000000lvgk461TtN.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001qvvgF38HVc4.html","songid":"001qvvgF38HVc4","title":"说好不哭（with 五月天阿信）","author":"周杰伦","lrc":"[ti:说好不哭（With 五月天阿信）]\n[ar:周杰伦]\n[al:说好不哭（With 五月天阿信）]\n[by:]\n[offset:0]\n[00:00.00]说好不哭（with 五月天阿信） - 周杰伦 (Jay Chou)\n[00:14.94]词：方文山\n[00:19.09]曲：周杰伦\n[00:23.24]周杰伦：\n[00:26.51]没有了联络 后来的生活\n[00:29.76]我都是听别人说\n[00:32.85]说你怎么了 说你怎么过\n[00:36.02]放不下的人是我\n[00:39.20]人多的时候 就待在角落\n[00:42.34]就怕别人问起我\n[00:45.37]你们怎么了 你低着头\n[00:48.30]护着我连抱怨都没有\n[00:51.82]电话开始躲 从不对我说\n[00:54.98]不习惯一个人生活\n[00:58.11]离开我以后 要我好好过\n[01:01.32]怕打扰想自由的我\n[01:04.39]都这个时候 你还在意着\n[01:07.56]别人是怎么怎么看我的\n[01:10.77]拼命解释着 不是我的错 是你要走\n[01:15.55]眼看着你难过 挽留的话却没有说\n[01:28.14]你会微笑放手 说好不哭让我走\n[01:52.13]阿信：\n[01:54.95]电话开始躲 从不对我说\n[01:58.17]不习惯一个人生活\n[02:01.26]离开我以后 要我好好过\n[02:04.41]怕打扰想自由的我\n[02:07.62]都这个时候 你还在意着\n[02:10.62]别人是怎么怎么看我的\n[02:13.90]拼命解释着 不是我的错 是你要走\n[02:18.51]合：\n[02:18.71]眼看着你难过 挽留的话却没有说\n[02:31.28]你会微笑放手 说好不哭让我走\n[02:50.54]周杰伦：\n[02:53.38]你什么都没有 却还为我的梦加油\n[03:04.99]阿信：\n[03:05.92]心疼过了多久\n[03:09.83]周杰伦：\n[03:10.02]过了多久\n[03:12.58]合：\n[03:12.77]还在找理由等我","url":"http://dl.stream.qqmusic.qq.com/C100001qvvgF38HVc4.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000002gBTVk4JEE2T.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/002y5fQY3kxxLU.html","songid":"002y5fQY3kxxLU","title":"不","author":"梁铭琛","lrc":"[ti:不]\n[ar:梁铭琛]\n[al:不]\n[by:]\n[offset:0]\n[00:00.35]不 - 梁铭琛\n[00:01.28]词：梁铭琛\n[00:02.21]曲：梁铭琛\n[00:03.10]制作人：梁铭琛\n[00:04.39]编曲：薛涛\n[00:05.24]电吉他：施胜强\n[00:06.49]监制：独木\n[00:07.59]人声录制：吴佳敏 @好乐無荒 Studio\n[00:09.86]弦乐演奏：国际首席爱乐乐团\n[00:12.19]弦乐录音室：金田录音棚（北京）\n[00:12.59]弦乐监制：贺翔基\n[00:13.46]和声/编写：刘博洋\n[00:13.69]混音/母带：鲍锐 @录顶技 Studio\n[00:14.02]OP/SP：独木音乐\n[00:16.18]习惯了面对复杂的过程\n[00:22.34]不想描述 到底有多残忍\n[00:31.53]厌倦着所有无情的施舍\n[00:37.30]不要再说 那是情感的温热\n[00:44.44]停留在忽远忽近的非绝佳场所\n[00:51.76]说不清是你错了 还是我\n[00:59.00]结局要难过\n[01:02.79]才能显得出我的懦弱\n[01:07.34]不在乎你的选择 你的以后\n[01:12.22]因为不再是我\n[01:14.97]不要在迷茫过后\n[01:17.88]才能懂得始终爱你的人\n[01:22.00]无限期的不甘妥协\n[01:25.07]终究得不到遗留下的温存\n[01:29.71]不堪一击的那个人\n[01:32.45]背对着伤痕深埋下了灵魂\n[01:37.23]再附上余温的陪衬\n[01:41.65]不愿一个人 虽然很安稳\n[01:49.58]积攒了太多失望的结果\n[01:56.15]不愿沉默 却又不知所措\n[02:04.82]厌倦着所有无趣的生活\n[02:11.10]不要再说 那是自己的选择\n[02:18.17]停留在忽远忽近的非绝佳场所\n[02:25.76]说不清是你错了 还是我\n[02:32.79]结局若难过\n[02:36.26]就让懦弱代替我的错\n[02:41.09]不在乎你的选择 你的以后\n[02:45.81]因为不再是我\n[02:48.81]不要在迷茫过后\n[02:51.54]才能懂得始终爱你的人\n[02:55.71]无限期的不甘妥协\n[02:58.82]终究得不到遗留下的温存\n[03:03.17]不堪一击的那个人\n[03:06.19]背对着伤痕深埋下了灵魂\n[03:11.01]再附上余温的陪衬\n[03:15.41]不愿一个人 虽然很安稳\n[03:26.08]虽然很安稳\n[03:33.72]不如就安稳\n[03:41.24]谁让谁安稳\n[03:48.51]不要在迷茫过后\n[03:51.52]才能懂得始终爱你的人\n[03:55.78]遗忘着彼此的身份\n[03:58.66]终究忘不掉遗留下的温存\n[04:03.81]不堪一击的那个人\n[04:06.13]背对着伤痕深埋下了灵魂\n[04:10.93]再附上余温的陪衬\n[04:15.23]不愿一个人 虽然很安稳","url":"http://dl.stream.qqmusic.qq.com/C100002y5fQY3kxxLU.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000004BvJuh0NMXUL.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/0041EAWY2D9o9j.html","songid":"0041EAWY2D9o9j","title":"不染","author":"简弘亦","lrc":"[ti:不染]\n[ar:简弘亦]\n[al:不染]\n[by:]\n[offset:0]\n[00:00.00]不染 - 简弘亦\n[00:04.68]词：海雷\n[00:09.37]曲：简弘亦\n[00:14.06]编曲：丁培峰\n[00:18.75]录音：简弘亦\n[00:23.44]混音：王勖\n[00:28.12]录音棚：简弘亦工作室\n[00:32.81]不愿染是与非 怎料事与愿违\n[00:39.67]心中的花枯萎 时光它去不回\n[00:46.78]但愿洗去浮华 掸去一身尘灰\n[00:53.82]再与你一壶清酒 话一世沉醉\n[01:00.93]不愿染是与非 怎料事与愿违\n[01:07.99]心中的花枯萎 时光它去不回\n[01:15.11]回忆辗转来回 痛不过这心扉\n[01:22.14]愿只愿余生无悔 随花香远飞\n[01:29.62]一壶清酒 一身尘灰\n[01:36.65]一念来回度余生无悔\n[01:43.74]一场春秋 生生灭灭 浮华是非\n[01:50.80]待花开之时再醉一回\n[02:25.74]不愿染是与非 怎料事与愿违\n[02:32.67]心中的花枯萎 时光它去不回\n[02:39.69]回忆辗转来回 痛不过这心扉\n[02:47.00]愿只愿余生无悔 随花香远飞\n[02:54.39]一壶清酒 一身尘灰\n[03:01.27]一念来回度余生无悔\n[03:08.37]一场春秋 生生灭灭 浮华是非\n[03:15.54]待花开之时再醉一回\n[03:22.52]愿这生生的时光不再枯萎\n[03:29.62]待花开之时再醉一回\n[03:36.59]愿这生生的时光不再枯萎\n[03:43.73]再回首浅尝心酒余味\n[03:50.71]一壶清酒 一身尘灰\n[03:57.72]一念来回度余生无悔\n[04:04.88]一场春秋 生生灭灭 浮华是非\n[04:11.97]待花开之时再醉一回\n[04:19.02]一壶清酒 一身尘灰\n[04:26.08]一念来回度余生无悔\n[04:33.02]一场回忆 生生灭灭 了了心扉\n[04:40.14]再回首浅尝心酒余味\n[04:47.31]一场回忆 生生灭灭 了了心扉\n[04:54.27]再回首浅尝心酒余味","url":"http://dl.stream.qqmusic.qq.com/C1000041EAWY2D9o9j.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000002xSwB5359vcP.jpg"}]
     * code : 200
     * error :
     */
    private int code;
    private String error;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getError() {
        return error;
    }

    public void setError(String error) {
        this.error = error;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * type : qq
         * link : http://y.qq.com/n/yqq/song/003aPyzn20chCt.html
         * songid : 003aPyzn20chCt
         * title : 不
         * author : 陈百强
         * lrc : [ti:不]
         [ar:陈百强]
         [al:228550]
         [by:]
         [offset:0]
         [00:00.00]不 - 陈百强 (Danny Chan)
         [00:04.11]词：郑国江
         [00:08.23]曲：鲍比达
         [00:12.34]请 不要问
         [00:17.02]请 不要问
         [00:23.29]只想快乐
         [00:28.38]不想有恨
         [00:34.08]游子一般步伐没法歇一阵
         [00:39.51]我只求新
         [00:44.54]年青的心没法锁得太紧
         [00:50.59]身边一片缤纷
         [00:55.95]不愿生根
         [00:58.90]怕留脚印
         [01:01.60]不定的心
         [01:03.62]永不为谁留恨
         [01:06.40]你不需要
         [01:09.42]亦不必要
         [01:12.13]愁城坐困 为我等
         [01:17.17]请 不要问
         [01:22.83]请 不要问
         [01:28.21]倘使有梦
         [01:33.73]尽管去寻
         [01:39.74]行色匆匆但愿莫再追问
         [01:45.17]太多原因
         [01:49.93]年青的心没法知得太深
         [01:55.70]不想使你担心
         [02:01.60]不愿生根
         [02:04.39]怕留脚印
         [02:07.05]不定的心
         [02:09.28]永不为谁留恨
         [02:11.96]你不需要
         [02:14.94]亦不必要
         [02:17.77]愁城坐困 为我等
         [02:23.49]心是真心
         [02:25.33]
         [02:26.36]却难永印
         [02:29.01]今日的真
         [02:31.07]瞬息便成疑问
         [02:34.42]你不需要
         [02:36.87]亦不必要
         [02:39.41]常常为我 认真
         [02:47.03]请 不要问
         [02:52.75]请 不要问
         [02:58.64]心中说话
         [03:04.34]不想告人
         [03:09.61]请 不要问
         [03:14.98]请 不要问
         [03:21.07]心中说话
         [03:26.31]不想告人
         [03:31.79]心中说话
         [03:37.17]不想告人
         * url : http://dl.stream.qqmusic.qq.com/C100003aPyzn20chCt.m4a?fromtag=38
         * pic : http://y.gtimg.cn/music/photo_new/T002R300x300M000001eP4c53pMFrT.jpg
         */

        private String type;
        private String link;
        private String songid;
        private String title;
        private String author;
        private String lrc;
        private String url;
        private String pic;

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }

        public String getLink() {
            return link;
        }

        public void setLink(String link) {
            this.link = link;
        }

        public String getSongid() {
            return songid;
        }

        public void setSongid(String songid) {
            this.songid = songid;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }
    }
}
